In [6]:
import pandas as pd
import mysql.connector as conn

mydb = conn.connect(host = 'localhost', user = 'root', password="root")
cursor = mydb.cursor()

# Q-1. Write an SQL query to print the first three characters of  FIRST_NAME from Worker table.

In [9]:
data_1 = pd.read_sql("SELECT SUBSTRING( First_Name, 1, 3 ) as FIRST_NAME FROM  employees.Worker",mydb)

In [10]:
data_1

   FIRST_NAME
0         Siv
1         Ran
2         san
3         Val
4         Poo
5         Ana
6         Aay
7         Sug
8         Raj
9         Ram
10        Sha
11        Jin
12        Bab
13        Sar
14        Mur
15        Vel
16        Man

# Q-2. Write an SQL query to find the position of the alphabet (‘a’) in the first name column ‘Amitabh’ from Worker table.

In [22]:
data_2 = pd.read_sql("SELECT POSITION('a' IN First_Name) as a_pos FROM employees.Worker where First_Name = 'Amitabh'",mydb)
data_2

   a_pos
0      1

# Q-3. Write an SQL query to print the name of employees having the highest salary in each department.

In [27]:
data_3 = pd.read_sql("Select  department, MAX(salary) AS 'Highest salary' FROM employees.worker GROUP BY department",mydb)
data_3

    department  Highest salary
0           IT          340932
1         Engg          210000
2  Content Dev          250001
3         Mech          150001
4       Tester           50000
5     Accounts           30000